---
title: RebarSpliceByRulesResult
classe: Autodesk.Revit.DB.Structure.RebarSpliceByRulesResult
namespace: Autodesk.Revit.DB.Structure
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# RebarSpliceByRulesResult

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `RebarSpliceByRulesError Error { get; }` | `rebarSpliceByRulesResult.Error` | RebarSpliceByRulesError |
| `Boolean IsValidObject { get; }` | `rebarSpliceByRulesResult.IsValidObject` | Boolean |
| `Void Dispose()` | `rebarSpliceByRulesResult.Dispose()` | Void |
| `IList<RebarSpliceGeometry> GetSpliceGeometries()` | `rebarSpliceByRulesResult.GetSpliceGeometries()` | IList<RebarSpliceGeometry> |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```